<?php

return [
    'notFound'           => 'Мероприятие не найдено.',
    'noUpcomingEvents'   => 'Нет предстоящих мероприятий.',
    'invalidQrCode'      => 'QR-код не верный.',
    'notExists'          => 'Такого мероприятия не существует.',
    'alreadyRegistered'  => 'Вы уже зарегистрировались на это мероприятие.',
    'registrationClosed' => 'Регистрация на мероприятие уже закончилась или ещё не начиналась.',
    'noTicketsAvailable' => 'Регистрация закрыта — все места уже забронированы.',
    'notRegistered'      => 'Вы ещё не регистрировались на это мероприятие.',
    'bookingSuccess'     => 'Вы успешно зарегистрировались на мероприятие.',
    'cancelSuccess'      => 'Вы отменили бронирование на это мероприятие.',
];
